app/controllers/items_controller.rb

SELECT * FROM `items`
---
  def index
    @items = Item.all

INSERT INTO `item_orders` (`created_at`, `order_id`, `updated_at`, `item_id`) VALUES('2010-12-16 05:17:38', 21, '2010-12-16 05:17:38', NULL)
INSERT INTO `items` (`name`, `price`, `created_at`, `updated_at`) VALUES('imli', '22', '2010-12-03 13:00:49', '2010-12-03 13:00:49')
INSERT INTO `orders` (`created_at`, `total_price`, `updated_at`, `orders_details`) VALUES('2010-12-08 10:17:22', 53, '2010-12-08 10:17:22', '--- \nTomato: \"53\"\napple: \"45\"\nmango: \"20\"\nPotato: \"12\"\n')
---
  def selected_item
    @price=0
    if params[:item]
      @selected_items={}
      params[:item].each do |item|
        item=item.split("_")
        @selected_items[item[0]]=item[1]
        @price =@price+item[1].to_i
      end
      @order=Order.create(:total_price =>@price )

SELECT * FROM `items` WHERE (`items`.`id` = 1)
---
  def show
    @item = Item.find(params[:id])

SELECT * FROM `items` WHERE (`items`.`id` = 980190962)
---
  def edit
    @item = Item.find(params[:id])

INSERT INTO `items` (`name`, `price`, `created_at`, `updated_at`) VALUES('grapes', '30', '2010-12-03 04:59:36', '2010-12-03 04:59:36')
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save

SELECT * FROM `items` WHERE (`items`.`id` = 980190962)
---
  def update
    @item = Item.find(params[:id])

SELECT * FROM `items` WHERE (`items`.`id` = 980190962)
DELETE FROM `items` WHERE `id` = 980190962
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy