app/controllers/item_orders_controller.rb

  def index
    @item_orders = ItemOrder.all
---
SELECT * FROM `item_orders`

  def create
    @item_order = ItemOrder.new(params[:item_order])

    respond_to do |format|
      if @item_order.save
---
INSERT INTO `item_orders` (`created_at`, `order_id`, `updated_at`, `item_id`) VALUES('2010-12-16 06:24:02', NULL, '2010-12-16 06:24:02', NULL)