app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT * FROM `orders`

  def order_details
    @orders=Order.last
    @price=@orders.total_price
    @data={}
   # @data=YAML::load(@orders.orders_details){|item| puts item.inspect}
    items=@orders.item_orders
    items.each do |item|
      @it=Item.find_by_id(item.item_id)
---
SELECT * FROM `orders` ORDER BY orders.id DESC LIMIT 1
SELECT * FROM `item_orders` WHERE (`item_orders`.order_id = 25)
SELECT * FROM `items` WHERE (`items`.`id` = 1) LIMIT 1

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 980190962)

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 980190962)

  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save
---
INSERT INTO `orders` (`created_at`, `total_price`, `updated_at`, `orders_details`) VALUES('2010-12-08 11:25:22', NULL, '2010-12-08 11:25:22', NULL)

  def update
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 980190962)

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 980190962)
DELETE FROM `orders` WHERE `id` = 980190962