app/controllers/users_controller.rb

INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('VaPmP8LfHGTUkmmRKC', '2010-12-10 10:13:15', '2010-12-10 10:13:15', 'c55c8a2f4c77faf1c6bc65018c41ef823f438a734434bd649a9bb6127c899aca08357c9adf92b443ec667fa0bb1091eb341604f32dd17aca041a6b96c97257ee', 'COg17tn6u5qigRLcocgk', '2010-12-10 10:13:15', 0, '127.0.0.1', '4PFzU9TJ1z5y15NxGftw', '2010-12-10 10:13:15', 'c7775376c87c92df6c729903c641a0ba281d900948c84cbfe8ad863322ded0252e614afcd63c75c495b953419aac68d85cd82d6d825d272c74b61253fc75eecc', 1, NULL, 'amar', NULL, 'reshubhan@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save